

# Расставьте знаки операций "плюс", "минус", "умножение" и скобки
# между числами "1 2 3 4 5" так, что бы получилось число "25".
#
# Использовать нужно только указанные знаки операций, но не обязательно все перечесленные.
# Порядок чисел нужно сохранить.

# Пример для чисел "1 2 3" и "9"
result = (1 + 2) * 3
print(result)

# TODO написать формулу для 1 2 3 4 5 и вывести значение на консоль

# Решение: (1 * 2 + 3) * 4 + 5 = 25
# Проверка: (1 * 2 + 3) * 4 + 5 = (2 + 3) * 4 + 5 = 5 * 4 + 5 = 20 + 5 = 25

my_result = (1 * 2 + 3) * 4 + 5
print(my_result)